#Из предложенного текстового файла (text18-28.txt) вывести на экран его содержимое,
#количество символов в тексте. Сформировать новый файл, в который поместить текст в
#стихотворной форме предварительно вставив после строки N (N – задается пользователем)
#произвольную фразу
#Чтение содержимого текстового файла и подсчет количества символов
with open('text18-28.txt', 'r') as file:
    content = file.read()
    count = len(content)
    print("Содержимое файла:")
    print(content)
    print("Количество символов в тексте:", count)
#Запрос пользователя для вставки фразы после строки N
N = int(input("Введите номер строки, после которой нужно вставить фразу: "))
phrase = input("Введите произвольную фразу для вставки: ")
#Формирование нового файла с текстом в стихотворной форме и вставкой фразы после строки N
lines = content.split('\n')
new_content = '\n'.join(lines[:N] + [phrase] + lines[N:])
with open('new_text.txt', 'w') as new_file:
    new_file.write(new_content)
print("Текст сохранен в новом файле new_text.txt")