#Дано множество A из N точек (N > 2, точки заданы своими координатами x, у).
#Найти наименьший периметр треугольника, вершины которого принадлежат различным точкам множества A,
#и сами эти точки (точки выводятся в том же порядке, в котором они перечислены при задании множества A).
#Расстояние R между точками с координатами (x1, y1) и (x2, у2) вычисляется по формуле:
#R = √(x2 – x1)2 + (у2 – y1)2.
#Для хранения данных о каждом наборе точек следует использовать по два списка: первый список для хранения абсцисс,
#второй — для хранения ординат.


