info_salon = [
    ('Аверина_Екатерина_Витальевна', 'Скобелина_Виктория_Витальевна', 'женский', 'каскад', 700, 55)
    ('Аверина_Екатерина_Витальевна', 'Скобелина_Виктория_Витальевна', 'женский', 'каскад', 700, 55)
    ('Аверина_Екатерина_Витальевна', 'Скобелина_Виктория_Витальевна', 'женский', 'каскад', 700, 55)
    ('Аверина_Екатерина_Витальевна', 'Скобелина_Виктория_Витальевна', 'женский', 'каскад', 700, 55)
    ('Аверина_Екатерина_Витальевна', 'Скобелина_Виктория_Витальевна', 'женский', 'каскад', 700, 55)
]