info_clients=[
    (1, 'Баринова Ю.В.', 'Скобелина В.В.', 'женский', 'Каскад', 1500),
    (2, 'Баринова Ю.В.', 'Москаленко Е.М.', 'женский', 'Лесенка', 1750),
    (3, 'Пупыркина Е.В.', 'Пупыркин Д.Ф.', 'мужской', 'Полубокс', 1300),
    (4, 'Баринова Ю.В.', 'Лебедева Е.К.', 'женский', 'Пикси', 1400),
    (5, 'Пупыркина Е.В.', 'Авдеев А.Е.', 'мужской', 'Андеркат', 1200),
    (6, 'Пупыркина Е.В.', 'Пупыркина А.А.', 'женский', 'Лесенка', 1250),
    (7, 'Виноградов И.К.', 'Мальцев И.И.', 'мужской', 'Помпадур', 1400),
    (8, 'Виноградов И.К.', 'Кондратьев А.А.', 'мужской', 'Канадка', 1300),
    (9, 'Пупыркина Е.В.', 'Дмитриков Е.Г.', 'мужской', 'Полубокс', 1300),
    (10, 'Виноградов И.К.', 'Владимирова В.В.', 'женский', 'Каскад', 1500)
]