info_clients=[
    (1, 'Баринова Ю.В.', 'Скобелина В.В.', 'женский', 'Каскад', 1500),
    (2, 'Баринова Ю.В.', 'Москаленко Е.М.', 'женский', 'Лесенка', 1750),
    (3, 'Пупыркина Е.В.', 'Пупыркин Д.Ф.', 'мужской', 'Полубокс', 1300),
    (4, 'Баринова Ю.В.', 'Лебедева Е.К.', 'женский', 'Пикси', 1400),
    (5, 'Гречанок', 'Кирилл', 'Демьянович', '14-03-2007', True, 'г.Ростов-на-Дону', 'Бухгалтер'),
    (6, 'Коренной', 'Никита', 'Владимирович', '07-10-2006', True, 'х.Победа', 'Программист'),
    (7, 'Марзимян', 'Азул', 'Эбекович', '28-12-2005', False, 'г.Азов', 'Связист'),
    (8, 'Барабиджан', 'Рамел', 'Парисонович', '21-08-2006', False, 'г.Батайск', 'Программист'),
    (9, 'Зазулин', 'Саманет', 'Таприч', '17-09-2007', True, 'г.Ростов-на-Дону', 'Бухгалтер'),
    (10, 'Валуев', 'Владимир', 'Викторович', '11-05-2006', True, 'г.Ростов-на-Дону', 'Программист'),
]